{
  "backend/main.mo": "Empty Motoko actor defining no backend logic.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten descriptions summarizing all major frontend components, hooks, and utilities.",
  "frontend/index.css": "Base Tailwind setup defining OKLCH color variables, dark mode tokens, and global background/foreground styles.",
  "frontend/index.html": "Root HTML file loading the React app with a single mount point and module script.",
  "frontend/src/App.tsx": "Main React component rendering the full single‑page layout with all sections, navbar, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Footer with company info, quick links, contact details, social icons, and attribution link.",
  "frontend/src/components/modals/LightboxModal.tsx": "Modal for viewing project images with keyboard navigation, focus trapping, and next/previous controls.",
  "frontend/src/components/motion/Reveal.tsx": "Scroll‑triggered reveal animation wrapper using IntersectionObserver and reduced‑motion support.",
  "frontend/src/components/navigation/Navbar.tsx": "Sticky responsive navbar with scroll‑based styling, mobile menu, and smooth section navigation.",
  "frontend/src/components/sections/AboutSection.tsx": "Displays an about section with an image, stats, and descriptive text using Reveal animations.",
  "frontend/src/components/sections/CtaSection.tsx": "Renders a call‑to‑action block with headline, button, and contact details over a styled background.",
  "frontend/src/components/sections/HeroSection.tsx": "Implements a hero banner with parallax background, headline, call‑to‑action buttons, and scroll indicator.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Shows a grid of project cards with images and opens a lightbox modal for navigation between projects.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists construction services with icons and descriptions in a responsive animated grid.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Provides a carousel of client testimonials with swipe/arrow navigation and animated transitions.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Displays reasons to choose the company and animated stat counters triggered on scroll.",
  "frontend/src/hooks/useActor.ts": "Creates or updates a backend actor based on Internet Identity and invalidates related queries when the actor changes.",
  "frontend/src/hooks/useCarousel.ts": "Manages carousel index state with next/previous controls and touch swipe handling.",
  "frontend/src/hooks/useCountUp.ts": "Animates counting from 0 to a target value when in view, respecting reduced-motion settings.",
  "frontend/src/hooks/useFocusTrap.ts": "Enables focus trapping within a container when active, cycling focus with Tab keys.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login handling, identity persistence, and related status flags.",
  "frontend/src/hooks/useInViewOnce.ts": "Detects when an element enters the viewport once using IntersectionObserver.",
  "frontend/src/hooks/useParallax.ts": "Applies scroll-based parallax transform to an element unless reduced motion is enabled.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for React Query hooks; currently empty due to no backend methods.",
  "frontend/src/hooks/useReducedMotion.ts": "Returns whether the user prefers reduced motion and listens for preference changes.",
  "frontend/src/hooks/useScrollPosition.ts": "Tracks whether the user has scrolled beyond a threshold using throttled scroll updates.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, typography, motion settings, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/scrollToSection.ts": "Smoothly scrolls to a section with navbar offset and sets focus afterward.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color variables, plugins, animations, and container settings.",
  "project_state.json": "Defines the project’s current state, design direction, required images, and existing feature requirements for a premium construction company website. Contains architectural notes, versioning info, and tracked features for build planning."
}